import tensorflow as tf
import numpy as np

TABLE_DATA = """시:분	강수	강수15M	강수60M	강수3H	강수6H	강수12H	일강수	기온℃	풍향1M	풍속1M(m/s)	풍향10M	풍속10M(m/s)	습도%	해면기압hPa
23:00	○	0	0	0	0	0.1	0.1	24.3	331.9	NNW	2.3	321.8	NW	2.3	80	1001.8
22:00	○	0	0	0	0	0.1	0.1	25.0	338.1	NNW	2.4	319.2	NW	1.5	78	1001.5
21:00	○	0	0	0	0	0.1	0.1	26.6	292.7	WNW	1.6	315.0	NW	1.6	67	1000.5
20:00	○	0	0	0	0	0.1	0.1	27.6	314.3	NW	1.1	303.5	WNW	2.5	62	1000.0
19:00	○	0	0	0	0.1	0.1	0.1	28.8	296.7	WNW	1.6	296.5	WNW	2.1	60	999.4
18:00	○	0	0	0	0.1	0.1	0.1	29.5	281.7	WNW	3.3	296.9	WNW	4.0	58	998.2
17:00	○	0	0	0	0.1	0.1	0.1	29.7	292.6	WNW	6.1	287.9	WNW	4.2	58	997.7
16:00	○	0	0	0.1	0.1	0.1	0.1	28.4	317.8	NW	3.2	303.5	WNW	3.7	64	998.0
15:00	○	0	0	0.1	0.1	0.1	0.1	28.8	296.3	WNW	4.6	289.6	WNW	4.6	66	997.8
14:00	○	0	0.1	0.1	0.1	0.1	0.1	26.8	296.6	WNW	3.3	283.7	WNW	3.3	78	997.9
13:00	○	0	0	0	0	0	0	27.4	313.6	NW	1.5	313.2	NW	2.0	72	997.8
12:00	○	0	0	0	0	0	0	27.5	261.4	W	3.5	264.9	W	3.2	70	997.8
11:00	○	0	0	0	0	0	0	26.6	273.1	W	2.3	274.5	W	3.0	73	997.8
10:00	○	0	0	0	0	0	0	26.3	304.6	NW	2.3	277.0	W	2.1	76	997.9
09:00	○	0	0	0	0	0	0	25.8	326.9	NNW	1.0	39.0	NE	0.6	83	997.7
08:00	○	0	0	0	0	1.0	0	24.7	338.7	NNW	2.0	327.8	NNW	1.5	87	997.8
07:00	○	0	0	0	0	2.1	0	24.3	306.4	NW	1.2	356.9	N	0.7	91	997.2
06:00	○	0	0	0	0	3.5	0	23.8	54.3	-	0.0	0.0	-	0.0	96	996.7
05:00	○	0	0	0	0	6.7	0	23.6	55.6	-	0.0	0.0	-	0.0	97	996.8
04:00	○	0	0	0	0	7.6	0	23.4	212.0	-	0.0	186.7	S	0.4	97	996.3
03:00	○	0	0	0	0	8.6	0	23.4	88.0	E	1.1	99.5	E	0.5	97	996.3
02:00	○	0	0	0	1.0	10.7	0	23.6	226.6	-	0.0	228.2	-	0.0	97	996.8
01:00	○	0	0	0	2.1	12.5	0	23.5	253.7	-	0.0	0.0	-	0.0	96	996.9
00:00	○	0	0	0	3.5	13.2	21.5	23.4	185.6	-	0.0	0.0	-	0.0	96	997.1"""
MODEL_PATH = './data/model.h5'


def extract_temperature_from_table():
    data = TABLE_DATA.split('\n')
    data = data[1:]
    data = [float(x.split('\t')[8]) for x in data[::-1]]
    return np.asarray(data)


def forecast(temperature):
    model = tf.keras.models.load_model(MODEL_PATH, compile=False)
    predict = model.predict(temperature[np.newaxis])[0][0]
    if predict > 30:
        print("날씨가 많이 더울 예정입니다. 야외활동에 주의하세요")
    elif predict > 25:
        print("날씨가 더울 예정입니다. 옷을 가볍게 입고 나가세요")
    elif predict > 15:
        print("야외활동 하기 좋은 날씨입니다. 책상을 벗어나는 하루를 만들어 보는건 어떨까요")
    elif predict > 5:
        print("선선한 날씨입니다. 가벼운 외투 하나더 챙겨 입는것을 추천드립니다")
    elif predict > -5:
        print("날씨가 추울 예정입니다. 옷을 두껍게 입고 나가세요")
    elif predict > -15:
        print("날씨가 많이 추울 예정입니다. 야외활동에 주의하세요")


if __name__ == '__main__':
    temperature = extract_temperature_from_table()
    forecast(temperature)

